huskyroboticsteam/Science_Board_2021-2022/science wow.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "CAN_RX.h"
#include "CAN_RX_aliases.h"
#include "CAN_TX.h"
#include "CAN_TX_aliases.h"
#include "CAN.h"
#include "I2C.h"
#include "I2C_I2C.h"
#include "I2C_PINS.h"
#include "I2C_I2C_PVT.h"
#include "I2C_PVT.h"
#include "I2C_BOOT.h"
#include "DBG_LED.h"
#include "DBG_LED_aliases.h"
#include "ERR_LED.h"
#include "ERR_LED_aliases.h"
#include "CAN_LED.h"
#include "CAN_LED_aliases.h"
#include "ADC.h"
#include "Humidity.h"
#include "Humidity_aliases.h"
#include "Temp.h"
#include "Temp_aliases.h"
#include "Clock_1.h"
#include "Status_Reg_LIM.h"
#include "LIM1.h"
#include "LIM1_aliases.h"
#include "LIM2.h"
#include "LIM2_aliases.h"
#include "LIM3.h"
#include "LIM3_aliases.h"
#include "LIM4.h"
#include "LIM4_aliases.h"
#include "LIM5.h"
#include "LIM5_aliases.h"
#include "isr_LIM.h"
#include "ENC_1_B.h"
#include "ENC_1_B_aliases.h"
#include "ENC_1_A.h"
#include "ENC_1_A_aliases.h"
#include "ENC_2_A.h"
#include "ENC_2_A_aliases.h"
#include "ENC_2_B.h"
#include "ENC_2_B_aliases.h"
#include "QuadDec_2.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "isr_1ms.h"
#include "CC1_isr.h"
#include "CC2_isr.h"
#include "QuadDec_1.h"
#include "Can_addr.h"
#include "Dip_1.h"
#include "Dip_1_aliases.h"
#include "Dip_2.h"
#include "Dip_2_aliases.h"
#include "Dip_3.h"
#include "Dip_3_aliases.h"
#include "Dip_4.h"
#include "Dip_4_aliases.h"
#include "timer_clock.h"
#include "isr_LEDs.h"
#include "Timer_LEDs.h"
#include "Timer_1ms.h"
#include "CAN_isr.h"
#include "CAN_HFCLK.h"
#include "I2C_SCBCLK.h"
#include "I2C_sda.h"
#include "I2C_sda_aliases.h"
#include "I2C_scl.h"
#include "I2C_scl_aliases.h"
#include "I2C_SCB_IRQ.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

